In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# make a path to project folder
path = r'C:\Users\egrnw\anaconda3\03-07-2025 Instacart Basket Analysis'

In [4]:
# import datafram
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

# 4. Wrangling

In [5]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
df.shape

(206209, 10)

In [16]:
# rename columns

df = df.rename(columns={
    'Surnam': 'Last Name',
    'STATE': 'State',
    'date_joined': 'Date Joined',
    'n_dependants': 'number of Dependents',
    'fam_status': 'Family Status',
    'income': 'Income'})

In [17]:
df.head()

,user_id,First Name,Last Name,Gender,State,Age,Date Joined,number of Dependents,Family Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [18]:
df.describe()

             user_id            Age  number of Dependents         Income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

# 5. Data Quality

In [19]:
#find missing values
missing_values = df.isnull().sum()

In [20]:
missing_values

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
State                       0
Age                         0
Date Joined                 0
number of Dependents        0
Family Status               0
Income                      0
dtype: int64

In [21]:
# find duplicate rows
duplicates = df.duplicated()

In [22]:
# total number of duplicates
num_duplicates = duplicates.sum()

In [23]:
num_duplicates

np.int64(0)

## no duplicates found

In [24]:
# column types
df.dtypes

user_id                  int64
First Name              object
Last Name               object
Gender                  object
State                   object
Age                      int64
Date Joined             object
number of Dependents     int64
Family Status           object
Income                   int64
dtype: object

looks fine

# 6. Combining Data

In [28]:
#import datafram
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merged_grouped.pkl'))

In [29]:
# combine customer with ords_prods_merge
df_merged = pd.merge(ords_prods_merge, df, on='user_id', how='inner')

In [30]:
df_merged.head()

,Unnamed: 0,Unnamed: 0_x,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,...,order_frequency_flag,First Name,Last Name,Gender,State,Age,Date Joined,number of Dependents,Family Status,Income
0,0,0,2539329,1,prior,1,2,8,NaN,196,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,1,0,2539329,1,prior,1,2,8,NaN,14084,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2,0,2539329,1,prior,1,2,8,NaN,12427,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,3,0,2539329,1,prior,1,2,8,NaN,26088,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,4,0,2539329,1,prior,1,2,8,NaN,26405,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [31]:
df_merged.shape

(1000000, 37)

In [32]:
# export
df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cust_merge.pkl'))